<?php

namespace Database\Seeders;
use App\Models\Projects\Category;
use App\Models\Projects\Criteria;
use App\Models\Projects\Evaluator;
use Illuminate\Database\Seeder;

class CriteriaSeeder extends Seeder
{
    /**
     * Run the database seeds.
     *
     * @return void
     */
    public function run()
    {
        $criterias = [
            [
                'name'=> 'سؤال البحث (المشكلة) 10',
                'description' => 'وصف الاحتياج العملي أو مشكلة يجب حلها - تحديد معايير للحل المقترح محدداته وقيوده',
                'mark' => 'ضعيف(0-3)، متوسط(4-6)، جيد(7-8)، ممتاز(9-10)'
            ],
            [
                'name'=> 'التصميم والمنهجية 15',
                'description' => 'استكشاف بدائل لحل الصعوبات التي واجهت الباحث - تحديد الحل بشكل متكامل وواضح - تطوير نموذج أولي',
                'mark' => 'ضعيف(0-4)، متوسط(5-9)، جيد(10-13)، ممتاز(14-15)'
            ],
            [
                'name'=> 'التنفيذ/البناء والاختبار 20',
                'description' => 'النموذج الأولي يتسق مع التصميم المستهدف - تم اختبار النموذج الأولي في ظروف مختلفة عدة مرات - يظهر النموذج الأولى مهارة هندسية واكتمال العمل',
                'mark' => 'ضعيف(0-6)، متوسط(7-12)، جيد(13-16)، ممتاز(17-20)'
            ],
            [
                'name'=> 'الإبداع 20',
                'description' => 'يوضح المشروع إبداعاً متميزاً في واحد أو اكثر من المعايير المذكورة أعلاه',
                'mark' => 'ضعيف(0-6)، متوسط(7-12)، جيد(13-16)، ممتاز(17-20)'
            ],
            [
                'name'=> 'لوحة العرض 10',
                'description' => 'ترتيب منطقي ومتسلسل للمادة العلمية - وضوح الرسومات والأشكال البيانية - عرض الوثائق الداعمة للبحث "المراجع"',
                'mark' => 'ضعيف(0-3)، متوسط(4-6)، جيد(7-8)، ممتاز(9-10)'
            ],
            [
                'name'=> 'المقابلة 25',
                'description' => 'ردود واضحة ومدروسة على الأسئلة - فهم العلوم الأساسية ذات الصلة بالمشروع - فهم النتائج جيدا وما تم استخلاصه منها - درجة الاستقلالية في تنفيذ المشروع - تقدير الأثر العلمي والاجتماعي والاقتصادي المحتمل - جودة الأفكار المقترحة للاستمرار في البحث مستقبلا - لمشاريع الفريق: المساهمات وتفهم المشروع من قبل جميع أعضاء الفريق',
                'mark' => 'ضعيف(0-7)، متوسط(8-15)، جيد(16-20)، ممتاز(21-25)'
            ],
        ];
        Criteria::insert($criterias);
    }
}
